app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings" ORDER BY created_at DESC
---
    def index
      @listings = Listing.all

INSERT INTO "listings" ("name", "description", "price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
      @listing = Listing.new(listing_params)
      @listing.user_id = current_user.id #Devise uses helpful keyword current_user which is getting current user and setting it to the id of the current listing

      respond_to do |format|
        if @listing.save

UPDATE "listings" SET "updated_at" = $1 WHERE "listings"."id" = $2  [["updated_at", "2019-05-07 23:22:36.795794"], ["id", 6]]
---
    def update
      respond_to do |format|
        if @listing.update(listing_params)