app/controllers/listings_controller.rb

    def create
      @listing = Listing.create(listing_params)
---
INSERT INTO "listings" ("name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "This is a new listing"], ["description", "Testing"], ["price", "50.0"], ["created_at", "2019-05-05 23:19:59.253962"], ["updated_at", "2019-05-05 23:19:59.253962"]]