app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."seller_id" = $1 ORDER BY created_at DESC  [["seller_id", 3]]
---
  def sales
    @orders = Order.all.where(seller: current_user).order("created_at DESC")

SELECT "orders".* FROM "orders" WHERE "orders"."buyer_id" = $1 ORDER BY created_at DESC  [["buyer_id", 3]]
---
  def purchases
    @orders = Order.all.where(buyer: current_user).order("created_at DESC")

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def new
    @order = Order.new
    @listing = Listing.find(params[:listing_id])

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
INSERT INTO "orders" ("address", "city", "state", "created_at", "updated_at", "listing_id", "buyer_id", "seller_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @order = Order.new(order_params) #create new order and pass in parameters from private section below
    @listing = Listing.find(params[:listing_id]) #can find the listing of the id that is being bought in the url
    @seller = @listing.user #the seller of the listing is the same as the user who created the listing

    #tells rails how to fill out columns
    @order.listing_id = @listing.id #tell rails how to fill in order listing id in datasbase with the listing id
    @order.buyer_id = current_user.id #Tells rails to fil out the buyer id column in the database with the current user id
    @order.seller_id = @seller.id #Tells rails to fill out seller id coluumn in the database

    respond_to do |format|
        if @order.save